[
    {
      "ListingID": 4,
      "ListingTypeID": 5,
      "ListingTypeDescription": "Close Out",
      "Rank": 5,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 1067,
      "ProductCode": "KON1",
      "ProductTitle": "K-ON (Blu-Ray 1)",
      "ProductDescription": "When Yui Hirasawa enters high school, she wants to join a club but cant decide which one is right for her. Fortunately, the Light Music Club is desperate to find another member or else theyll be disbanded! With the enticement of delicious snacks and assurances that no musical experience is necessary, Yui joins up, becoming the guitarist in this all-girl high school rock band. Together with Mio Akiyama on bass, Tsumugi Kotobuki on keyboard, and Ritsu Tainaka on drums, theyre going to rock the school and someday make it to the Budokan! Now, if only they can just put down the snacks long enough to practice...",
      "UnitPrice": 34.98,
      "YourPrice": 26.94,
      "CategoryName": "Comedy",
      "ProductAgeRating": "13+",
      "ProductLength": 100,
      "ProductYearCreated": 2009,
      "MediumName": "Blu-Ray",
      "PublisherName": "BANDAI",
      "OnSale": true,
      "RatingID": 5
    },
    {
      "ListingID": 5,
      "ListingTypeID": 5,
      "ListingTypeDescription": "Close Out",
      "Rank": 6,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 1068,
      "ProductCode": "KON2",
      "ProductTitle": "K-ON (Blu-Ray 2)",
      "ProductDescription": "As the Light Music Club rehearses for their performance at the school festival, they realize that theyre not officially registered as a club. They need to quickly find a faculty advisor, but thats not something that a little blackmail cant fix. As their new club advisor, Miss Yamanaka coaches Yui to become the frontman of the band and pushes her to the point of losing her voice. Mio is forced to be the lead vocalist in her stead, but can she overcome her stage fright?\nLater, the Light Music Club celebrates Christmas with a party and gift exchange, and soon another school year begins. If they want the Light Music Club to live on even after they graduate, theyre going to have to recruit new members, and that means another performance at the freshman reception!",
      "UnitPrice": 34.98,
      "YourPrice": 26.24,
      "CategoryName": "Comedy",
      "ProductAgeRating": "13+",
      "ProductLength": 100,
      "ProductYearCreated": 2009,
      "MediumName": "Blu-Ray",
      "PublisherName": "BANDAI",
      "OnSale": true,
      "RatingID": 5
    },
    {
      "ListingID": 6,
      "ListingTypeID": 5,
      "ListingTypeDescription": "Close Out",
      "Rank": 7,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 1069,
      "ProductCode": "KON3",
      "ProductTitle": "K-ON (Blu-Ray 3)",
      "ProductDescription": "Azusa has just joined the Light Music Club and she is shocked that all they do is drink tea and eat snacks instead of practicing. The rest of the band reassures her that they will practice hard at their training camp, but despite Azusas objections the girls end up playing all day at the beach.\nAzusa soon learns that reason why the band plays so well is because they have so much fun together. With the school festival right around the corner, the girls still have some hurdles to clear, like filling out the stage use application, doing maintenance on Yuis guitar, and coming up with a band name!",
      "UnitPrice": 34.98,
      "YourPrice": 22.49,
      "CategoryName": "Comedy",
      "ProductAgeRating": "13+",
      "ProductLength": 100,
      "ProductYearCreated": 2009,
      "MediumName": "Blu-Ray",
      "PublisherName": "BANDAI",
      "OnSale": true,
      "RatingID": 5
    },
    {
      "ListingID": 7,
      "ListingTypeID": 5,
      "ListingTypeDescription": "Close Out",
      "Rank": 8,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 1070,
      "ProductCode": "KON4",
      "ProductTitle": "K-ON (Blu-Ray 4)",
      "ProductDescription": "The school festival is here again, but Yui is out sick! The girls try to make do with Azusa on lead guitar when suddenly Yui shows up. But her guitar playing is just too perfect and shes seems to be too polite to everyone. What has happened to Yui, and will she be make it to the performance in time?\nMelancholy has set in on a cold winter day, as all the girls face some troubles doing their own thing. But a sudden text message from Yui cheers them up and they are all able to rally together and rock in the New Year at their first live house performance!",
      "UnitPrice": 34.98,
      "YourPrice": 26.24,
      "CategoryName": "Comedy",
      "ProductAgeRating": "13+",
      "ProductLength": 100,
      "ProductYearCreated": 2009,
      "MediumName": "Blu-Ray",
      "PublisherName": "BANDAI",
      "OnSale": true,
      "RatingID": 5
    },
    {
      "ListingID": 29,
      "ListingTypeID": 3,
      "ListingTypeDescription": "Top Sellers",
      "Rank": 5,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3277,
      "ProductCode": "STEALADOG",
      "ProductTitle": "How to Steal a Dog",
      "ProductDescription": "A young girl’s (Lee Re) father goes bankrupt. The girl's family loses their houses and they don't have a place to live. One day, the girl sees a flyer offering a reward of $500 for a missing dog. The young girl then sets out to \"borrow\" dogs from wealthy families to obtain reward money. ",
      "UnitPrice": 35,
      "YourPrice": 35,
      "CategoryName": "Foreign",
      "ProductAgeRating": "G",
      "ProductLength": 110,
      "ProductYearCreated": 2014,
      "MediumName": "DVD",
      "PublisherName": "Foreign Studio",
      "OnSale": false,
      "RatingID": 5
    },
    {
      "ListingID": 30,
      "ListingTypeID": 6,
      "ListingTypeDescription": "Live Action",
      "Rank": 4,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3301,
      "ProductCode": "ANTMAN1",
      "ProductTitle": "ANT-MAN",
      "ProductDescription": "The next evolution of the Marvel Cinematic Universe harnesses the tiniest but mightiest force know to man and introduces the newest member of the Avengers: MARVEL'S ANT-MAN. Armed with the amazing ability to shrink in scale but increase in strength, master thief Scott Lang joins forces with his new mentor Dr. Hank Pym to protect the secret behind his spectacular Ant-Man suit from ruthless villains! With humanity's fate in the balance, Pym and Lang must plan and pull off a daring heist against insurmountable odds. Filled with humor, awesome special effects and exclusive bonus features, this action-packed adventure takes you to new levels of pulse-pounding excitement! ",
      "UnitPrice": 32.99,
      "YourPrice": 22.99,
      "CategoryName": "Super Heroes",
      "ProductAgeRating": "PG-13",
      "ProductLength": 117,
      "ProductYearCreated": 2015,
      "MediumName": "Blu-Ray",
      "PublisherName": "Walt Disney Studio",
      "OnSale": true,
      "RatingID": 4
    },
    {
      "ListingID": 31,
      "ListingTypeID": 3,
      "ListingTypeDescription": "Top Sellers",
      "Rank": 8,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3308,
      "ProductCode": "PANZER",
      "ProductTitle": "Girls and Panzer",
      "ProductDescription": "You may have heard of kung fu, but the girls at Oarai Academy practice gun-fu - really, really BIG gun-fu, in fact. It's called Tankery, and it's the martial art of operating armored tanks! And even though the Tankery program at Oarai has been defunct for years, the student council has taken a sudden interest in the art and no one they set their sights on is safe.\r\n\r\nThat's how Miho Nishizumi, who transferred to Oarai specifically to stay out of tanks, gets drafted to join the newly revived Tankery divison. But it's not all bad, because joining her in Team Anglerfish are her new-found friends Saori, the highly receptive radio operator; Hana, a flower arranger turned gunner; Mako, their brilliant but chronically sleepy driver; and combustible tank fangirl and loader Yukari. They may not be on the half-track to fame and fortune, and maybe some of them would rather shop for tank tops than become tops in tanks, but once their focus is locked and loaded, they're absolutely driven.\r\n",
      "UnitPrice": 69.98,
      "YourPrice": 52.49,
      "CategoryName": "Adventure",
      "ProductAgeRating": "14+",
      "ProductLength": 300,
      "ProductYearCreated": 2013,
      "MediumName": "Blu-Ray",
      "PublisherName": "Sentai Filmworks",
      "OnSale": false,
      "RatingID": 4
    },
    {
      "ListingID": 32,
      "ListingTypeID": 2,
      "ListingTypeDescription": "New Items",
      "Rank": 3,
      "EffectiveDate": "2016-10-02T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3309,
      "ProductCode": "QUON",
      "ProductTitle": "Towa no Quon",
      "ProductDescription": "In the not-too-distant future, children are being born with special powers; marvelous and remarkable abilities. But what would seem like a wondrous gift turns out to be a dangerous curse. The world is now run by The Order, and these miraculous \"deviants\" are hunted down and killed.\r\n\r\nQuon and his group of Attractors are out to rescue these children before The Order's elite squad of ruthless cyborgs detect them. From their hideout beneath a popular amusement park, the Attractors use high tech gadgetry and their own remarkable abilities to save these children. They teach them to harness and control their powers to overthrow the very powers that seek to destroy them.\r\n",
      "UnitPrice": 69.98,
      "YourPrice": 52.49,
      "CategoryName": "Sci Fi / Action",
      "ProductAgeRating": "14+",
      "ProductLength": 300,
      "ProductYearCreated": 2012,
      "MediumName": "Blu-Ray",
      "PublisherName": "Sentai Filmworks",
      "OnSale": false,
      "RatingID": 3
    },
    {
      "ListingID": 33,
      "ListingTypeID": 2,
      "ListingTypeDescription": "New Items",
      "Rank": 2,
      "EffectiveDate": "2016-10-02T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3310,
      "ProductCode": "AKB0048B",
      "ProductTitle": "AKB0048: Next Stage (Season 2)",
      "ProductDescription": "AKB0048 Season 2: Next Stage Blu-ray Complete Collection \r\nThe road trip to war has already been brutal for the 77th generation of understudies to AKB0048, the combination singing group and combat squad seeking to bring peace and entertainment back to the universe. However, the competition between the individual candidates, as well as the remaining 75th and 76th generation understudies, is about to get even rougher.\r\n\r\nWith the opportunity to become a successor to one of the original members of the legendary singing squad hanging in the balance, the fights on stage and on the battlefield will become even more cutthroat, and things are only going to get nastier when it turns out that someone has been feeding critical information to the opposing DES forces.\r\n\r\nWill the revelation of the source of the Kiraras prove to be a deadly misstep in the intricate choreography that's allowed the team to keep dancing out of danger? Will public opinion prove to be more important than actual skill and valor as the squad undergoes a series of grueling trials by fan? The harmony and harmonization that's held this band of sisters together will be pushed to the breaking point!\r\n",
      "UnitPrice": 69.98,
      "YourPrice": 52.49,
      "CategoryName": "Sci Fi / Adventure",
      "ProductAgeRating": "13+",
      "ProductLength": 325,
      "ProductYearCreated": 2014,
      "MediumName": "Blu-Ray",
      "PublisherName": "Sentai Filmworks",
      "OnSale": false,
      "RatingID": 3
    },
    {
      "ListingID": 34,
      "ListingTypeID": 2,
      "ListingTypeDescription": "New Items",
      "Rank": 1,
      "EffectiveDate": "2016-10-02T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3311,
      "ProductCode": "HOUND",
      "ProductTitle": "Ghost Hound",
      "ProductDescription": "When he was three, Taro Komori and his sister were kidnapped, but the kidnapper was run over and killed before the ransom could be delivered. The police eventually found Taro, but not before his sister had died. Eleven years later, Taro still has nightmares of the events surrounding the kidnapping and is haunted by a tall, featureless specter.\r\n\r\nNow Taro searches for answers together with two unlikely companions: a brash transfer student from Tokyo who is himself haunted by the memory of a fellow student who committed suicide by jumping from the roof of the school, and the son of a man who committed suicide after being accused of being involved in the kidnapping. Unseen spirits, ghosts, and out-of-body experiences all combine in an intriguing exploration into the workings of memory and our perception of the world.\r\n",
      "UnitPrice": 59.98,
      "YourPrice": 44.99,
      "CategoryName": "Horror / Suspense",
      "ProductAgeRating": "14+",
      "ProductLength": 275,
      "ProductYearCreated": 2009,
      "MediumName": "DVD",
      "PublisherName": "Sentai Filmworks",
      "OnSale": false,
      "RatingID": 3
    },
    {
      "ListingID": 35,
      "ListingTypeID": 3,
      "ListingTypeDescription": "Top Sellers",
      "Rank": 6,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3314,
      "ProductCode": "EARTHSEA",
      "ProductTitle": "Tales from EarthSea",
      "ProductDescription": "In the land of Earthsea, crops are dwindling, dragons have reappeared, and humanity is giving way to choas. Journey with Lord Archmage Sparrowhawk, a master wizard, and Arren, a troubled young prince, on a tale of redemption and self-discovery as they search for the force behind the mysterious imbalnace that threatens to destroy their world.",
      "UnitPrice": 36.99,
      "YourPrice": 33.29,
      "CategoryName": "Fantasy",
      "ProductAgeRating": "13+",
      "ProductLength": 115,
      "ProductYearCreated": 2015,
      "MediumName": "Blu-Ray / DVD",
      "PublisherName": "STUDIO GHIBLI",
      "OnSale": false,
      "RatingID": 5
    },
    {
      "ListingID": 36,
      "ListingTypeID": 2,
      "ListingTypeDescription": "New Items",
      "Rank": 3,
      "EffectiveDate": "2016-10-02T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3318,
      "ProductCode": "YAMATO",
      "ProductTitle": "Space Battleship Yamato",
      "ProductDescription": "The year is 2199. Mankind teeters on the brink of extinction as the Gamilas, a heinous race of alien invaders, wage an endless war for the right to inhabit the Earth. The last hope for humanity lies on the distant planet of Iskander, and the only battleship capable of attempting the journey is the legendary Yamato. Armed with the devastatingly-powerful Wave Motion Cannon, grizzled Captain Okita and the Yamato's crew venture boldly into the darkest depths of space.\r\n\r\nThe Gamilas attack at every turn, but fallen hero Susumu Kodai and ace pilot Yuki Mori fight side by side for the future of their world. Together, these young lovers unlock the secrets of Iskander - only to face a harrowing voyage home that will change their world forever!\r\n",
      "UnitPrice": 29.98,
      "YourPrice": 22.49,
      "CategoryName": "Sci Fi / Action",
      "ProductAgeRating": "14+",
      "ProductLength": 138,
      "ProductYearCreated": 2014,
      "MediumName": "Blu-Ray / DVD",
      "PublisherName": "Other",
      "OnSale": false,
      "RatingID": 4
    },
    {
      "ListingID": 37,
      "ListingTypeID": 3,
      "ListingTypeDescription": "Top Sellers",
      "Rank": 7,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3320,
      "ProductCode": "GAMETHRNS5",
      "ProductTitle": "Game of Thrones (Season 5)",
      "ProductDescription": "The fifth season is very taken up with the theme of \"winter is coming.\" Jon Snow receives more air time than any other character. Numerous scenes are set in the North--either at the Wall or Winterfell--and are literally dark, cold, and gloomy. The overall atmosphere is pretty grim; creators push the violence level even higher than has been the case in past seasons. I didn't enjoy this season quite as much as the previous ones, but I found it to be pretty watchable. Season 5 involves a lot of transitioning: major characters spend a lot of time traveling around or positioning themselves for battle. As someone else commented, the season tends to pick up around episode 8, with the sense that next year will be pretty exciting. A couple of new locations are introduced--one successfully, the other not so much. I would have liked to have seen a lot more of the favorite characters, especially Jaime, Tyrian, and Brienne. Still, this series, even when a bit disappointing, is still way above most others. ",
      "UnitPrice": 79.98,
      "YourPrice": 39.99,
      "CategoryName": "TV Series",
      "ProductAgeRating": "NR",
      "ProductLength": 560,
      "ProductYearCreated": 2016,
      "MediumName": "Blu-Ray / DVD",
      "PublisherName": "HBO Home Video",
      "OnSale": true,
      "RatingID": 5
    },
    {
      "ListingID": 38,
      "ListingTypeID": 6,
      "ListingTypeDescription": "Live Action",
      "Rank": 2,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3323,
      "ProductCode": "DEADPOOL1",
      "ProductTitle": "DEADPOOL",
      "ProductDescription": "Hold onto your chimichangas, folks. From the studio that brought you all 3 Taken films comes DEADPOOL, the block-busting, fourth-wall-breaking masterpiece about Marvel Comics sexiest anti-hero: me! Go deep inside (I love that) my origin story...typical stuff...rogue experiment, accelerated healing powers, horrible disfigurement, red spandex, imminent revenge. Directed by overpaid tool Tim Miller, and starring God s perfect idiot Ryan Reynolds, Ed Skrein, Morena Baccarin, T. J. Miller and Gina Carano, DEADPOOL is a giddy slice of awesomeness packed with more twists than my enemies intestines and more action than prom night. Amazeballs! ",
      "UnitPrice": 19.96,
      "YourPrice": 39.99,
      "CategoryName": "Super Heroes",
      "ProductAgeRating": "R",
      "ProductLength": 108,
      "ProductYearCreated": 2016,
      "MediumName": "DVD",
      "PublisherName": "20th Century Fox",
      "OnSale": false,
      "RatingID": 4
    },
    {
      "ListingID": 40,
      "ListingTypeID": 6,
      "ListingTypeDescription": "Live Action",
      "Rank": 3,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3324,
      "ProductCode": "IPMAN3",
      "ProductTitle": "IP MAN 3",
      "ProductDescription": "Donnie Yen (Rogue One: A Star Wars Story and Crouching Tiger, Hidden Dragon 2) ignites the screen in a return to the role that made him an icon - as Ip Man, the real-life Wing Chun grandmaster who mentored Bruce Lee. In this explosive third installment of the blockbuster martial arts series, when a band of brutal gangsters led by a crooked property developer (Mike Tyson) make a play to take over the city, Master Ip is forced to take a stand. Fists will fly as some of the most incredible fight scenes ever filmed play out on the big screen.",
      "UnitPrice": 63.99,
      "YourPrice": 12.99,
      "CategoryName": "Martial Arts",
      "ProductAgeRating": "R",
      "ProductLength": 105,
      "ProductYearCreated": 2016,
      "MediumName": "DVD",
      "PublisherName": "Well Go USA",
      "OnSale": true,
      "RatingID": 4
    },
    {
      "ListingID": 42,
      "ListingTypeID": 6,
      "ListingTypeDescription": "Live Action",
      "Rank": 1,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3335,
      "ProductCode": "JLEAGUE01",
      "ProductTitle": "Batman vs Superman: Dawn of Justice",
      "ProductDescription": "The extended cut of \"Batman v Superman: Dawn of Justice\" includes 30 more minutes of story and action not seen in theaters! Also includes the Theatrical Version of the film plus over 2 hours of bonus content. From director Zack Snyder comes \"Batman v Superman: Dawn of Justice,\" starring Ben Affleck as Batman/Bruce Wayne and Henry Cavill as Superman/Clark Kent in the characters' first big-screen pairing. Fearing the actions of a god-like Super Hero left unchecked, Gotham City's own formidable, forceful vigilante takes on Metropolis's most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it's ever known before.",
      "UnitPrice": 35.99,
      "YourPrice": 24.99,
      "CategoryName": "Super Heroes",
      "ProductAgeRating": "R",
      "ProductLength": 182,
      "ProductYearCreated": 2016,
      "MediumName": "Blu-Ray / DVD",
      "PublisherName": "Warner Home Video",
      "OnSale": false,
      "RatingID": 4
    },
    {
      "ListingID": 43,
      "ListingTypeID": 2,
      "ListingTypeDescription": "New Items",
      "Rank": 8,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3336,
      "ProductCode": "SHANGRILA",
      "ProductTitle": "Shangri-La (Limited Edition)",
      "ProductDescription": "This limited edition of Shangri-La Part 1 contains episodes 1-12 and includes an artbox designed to hold both parts 1 and 2.\r\n\r\nIn the distant future, earthquakes and the effects of global warming have splintered Japanese society. Some struggle hand-to-mouth in the jungle-tangled ruins of civilization. Some live comfortably within the closed-off city of Atlas. Others lurk online, anonymously hacking the global economy. As nature grows more violent and the divide between classes expands, one spirited girl, Kuniko, must face her destiny and lead her people into the utopia of Atlas.\r\n\r\nThe city's ruthless government isn't going to welcome them with open arms, but Kuniko won't give up until the gates of Atlas are kicked open for good - even if it means discovering that the promised land she dreamed of is built upon a foundation of twisted secrets and lies.",
      "UnitPrice": 64.98,
      "YourPrice": 48.74,
      "CategoryName": "Sci Fi / Action",
      "ProductAgeRating": "17+",
      "ProductLength": 300,
      "ProductYearCreated": 2012,
      "MediumName": "DVD",
      "PublisherName": "FUNIMATION",
      "OnSale": true,
      "RatingID": 3
    },
    {
      "ListingID": 44,
      "ListingTypeID": 2,
      "ListingTypeDescription": "New Items",
      "Rank": 7,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-31T00:00:00",
      "ProductID": 3337,
      "ProductCode": "HARMONY",
      "ProductTitle": "HARMONY",
      "ProductDescription": "In a future ruled by an unwavering dedication to good health, three high school girls led by the defiant Miach Mihie attempt suicide as the ultimate act of rebellion. Tuan Kirie survives, but can't shake the hatred she has for the perfect world she lives in.\r\n\r\nYears later, a simultaneous mass suicide rocks the globe and sends society into a state of shock. A small group stands up to take credit for the event, claiming they've hijacked the consciousness of every person on the planet. Everything about the terrorists' message sounds too familiar to Tuan. She suspects her old friend Miach might be involved, but how could that be when she'd supposedly killed herself years earlier? Desperate for answers, Tuan launches an investigation that takes her across the globe chasing the ghost of her old friend. But what is Miach's end game? Will she finally wake the world from its monotonous slumber? Or, end it all for good?\r\n\r\n*Includes Digital HD Ultraviolet (subject to expiration and only redeemable in U.S.)",
      "UnitPrice": 34.98,
      "YourPrice": 26.24,
      "CategoryName": "Drama",
      "ProductAgeRating": "17+",
      "ProductLength": 120,
      "ProductYearCreated": 2016,
      "MediumName": "Blu-Ray / DVD",
      "PublisherName": "FUNIMATION",
      "OnSale": true,
      "RatingID": 4
    },
    {
      "ListingID": 45,
      "ListingTypeID": 1,
      "ListingTypeDescription": "Featured Titles",
      "Rank": 3,
      "EffectiveDate": "2016-10-01T00:00:00",
      "Expiration": "2018-10-30T00:00:00",
      "ProductID": 3338,
      "ProductCode": "HARUHIYUKI",
      "ProductTitle": "The Disappearance of Nagato Yuki-chan",
      "ProductDescription": "The Disappearance of Nagato Yuki-chan contains episodes 1-16 plus OVA.\r\n\r\nFrom the creator of the international hit The Melancholy of Haruhi Suzumiya comes a new spinoff featuring familiar faces! In an alternate universe, shy, awkward Yuki Nagato attempts to court her crush, Kyon, with the help of her best friend, the perky and indomitable Ryoko Asakura. Together, the trio defend their high school literature club from extermination and from the pestering of Haruhi Suzumiya and her lovable friend Koizumi! Watch as Yuki navigates normal high school life, like Christmas parties, festivals, and feelings. And when another side of Yuki comes out will full-force, will her chances with Kyon be obliterated? No true Haruhi devotee should miss The Disappearance of Nagato Yuki-chan!",
      "UnitPrice": 64.98,
      "YourPrice": 48.74,
      "CategoryName": "Comedy",
      "ProductAgeRating": "14+",
      "ProductLength": 400,
      "ProductYearCreated": 2016,
      "MediumName": "Blu-Ray / DVD",
      "PublisherName": "FUNIMATION",
      "OnSale": true,
      "RatingID": 4
    },
    {
      "ListingID": 46,
      "ListingTypeID": 4,
      "ListingTypeDescription": "Bargain Bin",
      "Rank": 5,
      "EffectiveDate": "2016-11-01T00:00:00",
      "Expiration": "2018-10-30T00:00:00",
      "ProductID": 1002,
      "ProductCode": "KONMOV",
      "ProductTitle": "K-ON: The Movie",
      "ProductDescription": "Graduation time is finally here, but the girls of the Sakuragaoka Girl's High Light Music Club aren't going to let the end of high school be the end of all they've built together. First though, they have to keep a promise to take a trip together, and like everything else they do, they're not doing it halfway. So it's time to hop on the bus - the double-decker bus that is - and go around the world as the band heads for the birthplace of the British Invasion: the United Kingdom!\n'On the way they're going to have to solve that one last big puzzle that's been vexing them: what to get for their underclassman rhythm guitarist Azusa, who will be taking over the club once they don their caps and gowns and leave Sakuragaoka for the last time. Get ready for a Magical Musical Tour as the whole gang takes in the sights and sounds of London and prepares for one last amazing encore!\n",
      "UnitPrice": 39.98,
      "YourPrice": 23.99,
      "CategoryName": "Comedy",
      "ProductAgeRating": "13+",
      "ProductLength": 110,
      "ProductYearCreated": 2013,
      "MediumName": "Blu-Ray",
      "PublisherName": "Sentai Filmworks",
      "OnSale": true,
      "RatingID": 5
    },
    {
      "ListingID": 47,
      "ListingTypeID": 4,
      "ListingTypeDescription": "Bargain Bin",
      "Rank": 6,
      "EffectiveDate": "2016-11-01T00:00:00",
      "Expiration": "2018-10-30T00:00:00",
      "ProductID": 1027,
      "ProductCode": "HARUHIDIS",
      "ProductTitle": "The Melancholy of Haruhi Suzumiya Movie: The Disappearance of Haruhi",
      "ProductDescription": "Ten days before Christmas, it seemed like just another ordinary day for the SOS Brigade; Haruhi came up with another one of her crazy ideas to hold a Christmas party in the club room. But things got weirder from there... The next day Kyon woke up to a world in which Haruhi didn't exist and no one besides him had any memory of her. How can someone like Haruhi Suzumiya, who's supposed to be center of the universe, just vanish?",
      "UnitPrice": 29.98,
      "YourPrice": 22.49,
      "CategoryName": "Comedy",
      "ProductAgeRating": "13+",
      "ProductLength": 164,
      "ProductYearCreated": 2011,
      "MediumName": "DVD",
      "PublisherName": "BANDAI",
      "OnSale": true,
      "RatingID": 5
    },
    {
      "ListingID": 48,
      "ListingTypeID": 4,
      "ListingTypeDescription": "Bargain Bin",
      "Rank": 7,
      "EffectiveDate": "2016-11-01T00:00:00",
      "Expiration": "2018-10-30T00:00:00",
      "ProductID": 1049,
      "ProductCode": "HARUHIS2",
      "ProductTitle": "The Melancholy of Haruhi Suzumiya (Complete Season 2)",
      "ProductDescription": "Haruhi continues her search for exciting ways to keep her world from being boring. Unfortunately, for Kyon and the rest of the SOS Brigade, they are forced to go along for the ride.\r\nOn the night of the Tanabata Star Festival, Kyon is transported back in time by Mikuru Asahina to what may be the source of what led Haruhi to search for aliens, time travelers, and espers. In the last two weeks of summer vacation, Haruhi leads the brigade on a dizzying list of summer time activities, eventually culminating in the brigade experiencing what they think is deja vu but they're actually re-living the same two weeks of summer over and over again. It's up to Kyon to figure out what's missing to get them out of their endless loop.\r\nAs fall rolls around, everyone prepares for the school arts festival, but Haruhi isn't content with their class's survey project. Instead, she hatches her own plan for the SOS Brigade to film and screen their own movie. Step behind the camera to see what went on to create the cinematic \"masterpiece\" that is The Adventures of Mikuru Asahina Episode 00!",
      "UnitPrice": 64.98,
      "YourPrice": 39.99,
      "CategoryName": "Comedy",
      "ProductAgeRating": "13+",
      "ProductLength": 350,
      "ProductYearCreated": 2010,
      "MediumName": "DVD",
      "PublisherName": "BANDAI",
      "OnSale": true,
      "RatingID": 5
    }
  ]